# Brewfile — Curated Dev Environment
# Persona: PM who occasionally codes
# Philosophy: Minimal, modern, reproducible

# =====================================
# Core CLI Tools
# =====================================

brew "git"        # version control
brew "gh"         # GitHub CLI (PRs, auth, repo ops)
brew "jq"         # JSON parsing in terminal
brew "ripgrep"    # fast code search (rg)
brew "fd"         # better `find`
brew "fzf"        # fuzzy finder (history, files)
brew "bat"        # better `cat` with syntax highlighting

# =====================================
# Shell & Environment
# =====================================

brew "starship"   # modern cross-shell prompt
brew "direnv"     # per-project environment variables (.envrc)

# =====================================
# Cloud & Infrastructure
# =====================================

brew "awscli"     # AWS CLI (S3, EC2, IAM, and more)

# =====================================
# Language Runtime
# =====================================

brew "python@3.14"  # scripting, tooling, experimentation (includes venv)
brew "rbenv"        # Ruby version manager
brew "ruby-build"   # Install Ruby versions via rbenv
brew "fnm"			# Node verson manager

# =====================================
# Core GUI Applications
# =====================================

cask "iterm2"              # terminal emulator
cask "sublime-text"        # lightweight editor
cask "visual-studio-code"  # primary editor
cask "docker-desktop"      # containers for local services
cask "raycast"             # launcher + window mgmt + clipboard
cask "tableplus"           # database GUI
cask "cleanshot"           # screenshots / recording

# =====================================
# Optional / Quality of Life
# =====================================

cask "font-hack-nerd-font" # proper glyphs for starship
cask "obsidian"            # local-first notes

# =====================================
# AI Dev Tools
# =====================================

cask "claude-code" # Anthropic's cli
cask "codex" # Open AI's cli
cask "claude"  # Anthropics desktop app
cask "chatgpt" # Open AI's desktop app