# Brewfile — Curated Dev Environment
# Persona: PM who occasionally codes
# Philosophy: Minimal, modern, reproducible

# =====================================
# Core CLI Tools
# =====================================

brew "git"        # version control
brew "gh"         # GitHub CLI (PRs, auth, repo ops)
brew "jq"         # JSON parsing in terminal
brew "ripgrep"    # fast code search (rg)
brew "fd"         # better `find`
brew "fzf"        # fuzzy finder (history, files)
brew "bat"        # better `cat` with syntax highlighting

# =====================================
# Shell & Environment
# =====================================

brew "starship"   # modern cross-shell prompt
brew "direnv"     # per-project environment variables (.envrc)

# =====================================
# Cloud & Infrastructure
# =====================================

brew "awscli"     # AWS CLI (S3, EC2, IAM, and more)
brew "supabase/tap/supabase" # Supabase CLI

# =====================================
# Networking
# =====================================

cask "tailscale"  # WireGuard mesh VPN — SSH into Mac Studio from anywhere

# =====================================
# Language Runtimes & Package Managers
# =====================================

brew "uv"           # fast Python package manager & venv tool (used by Granite Harbor)
brew "python@3.14"  # scripting, tooling, experimentation (includes venv)
brew "uv"           # replaces pip, poetry, and pyenv in one tool for python
brew "rbenv"        # Ruby version manager
brew "ruby-build"   # Install Ruby versions via rbenv
brew "fnm"          # Node version manager
brew "node"         # Node.js runtime
brew "pnpm"         # fast, disk-efficient package manager

# =====================================
# Editors & IDEs
# =====================================

cask "sublime-text"        # lightweight editor
cask "visual-studio-code"  # primary editor
cask "cursor"              # AI-native code editor
cask "zed"                 # GPU-accelerated code editor

# =====================================
# Core GUI Applications
# =====================================

cask "iterm2"              # terminal emulator
cask "docker-desktop"      # containers for local services
cask "tableplus"           # database GUI
cask "github"              # GitHub Desktop
cask "postman"             # API testing
cask "cleanshot"           # screenshots / recording

# =====================================
# AI Assistants
# =====================================

cask "claude"      # Anthropic's desktop app
cask "claude-code" # Anthropic's CLI
cask "codex"       # OpenAI's CLI
cask "chatgpt"     # OpenAI's desktop app

# =====================================
# Fonts & Quality of Life
# =====================================

cask "font-hack-nerd-font" # proper glyphs for starship
cask "font-lato"           # Lato font family
cask "obsidian"            # local-first notes
